TexasInstruments/mcupsdk-core/examples/drivers/epwm/epwm_protection_pru/am263px-lp/r5fss0-0_nortos/example.syscfg
epwm_xbar5.xbarOutput               = ["ICSSGPO0_PORT0"];
epwm_xbar5.instance                 = "EPWM_XBAR_4";
epwm_xbar5.$name                    = "CONFIG_EPWM_XBAR4_INPUTXBAR_TO_EPWM";
epwm_xbar5["xbarConfig-0"].instance = "INPUT_XBAR_4";
epwm_xbar5["xbarConfig-0"].$name    = "CONFIG_INPUT_XBAR4_ICSSGPO_TO_PWMXBAR";

epwm_xbar6.xbarOutput               = ["ICSSGPO1_PORT0"];
epwm_xbar6.instance                 = "EPWM_XBAR_5";
epwm_xbar6.$name                    = "CONFIG_EPWM_XBAR5_INPUTXBAR_TO_EPWM";
epwm_xbar6["xbarConfig-0"].instance = "INPUT_XBAR_5";
epwm_xbar6["xbarConfig-0"].$name    = "CONFIG_INPUT_XBAR5_ICSSGPO_TO_PWMXBAR";

epwm_xbar7.xbarOutput               = ["ICSSGPO2_PORT0"];
epwm_xbar7.instance                 = "EPWM_XBAR_6";
epwm_xbar7.$name                    = "CONFIG_EPWM_XBAR6_INPUTXBAR_TO_EPWM";
epwm_xbar7["xbarConfig-0"].instance = "INPUT_XBAR_6";
epwm_xbar7["xbarConfig-0"].$name    = "CONFIG_INPUT_XBAR6_ICSSGPO_TO_PWMXBAR";

epwm_xbar8.xbarOutput               = ["ICSSGPO3_PORT0"];
epwm_xbar8.instance                 = "EPWM_XBAR_7";
epwm_xbar8.$name                    = "CONFIG_EPWM_XBAR7_INPUTXBAR_TO_EPWM";
epwm_xbar8["xbarConfig-0"].instance = "INPUT_XBAR_7";
epwm_xbar8["xbarConfig-0"].$name    = "CONFIG_INPUT_XBAR7_ICSSGPO_TO_PWMXBAR";

int_xbar1.$name      = "CONFIG_INT_XBAR0";
int_xbar1.xbarOutput = ["EPWM9_INT"];

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$suggestSolution           = "EPWM0_A";
epwm1.EPWM.B.$suggestSolution           = "EPWM0_B";
epwm2.EPWM.A.$suggestSolution           = "EPWM1_A";
epwm2.EPWM.B.$suggestSolution           = "EPWM1_B";
epwm3.EPWM.A.$suggestSolution           = "EPWM2_A";
epwm3.EPWM.B.$suggestSolution           = "EPWM2_B";
gpio1.GPIO.$suggestSolution             = "GPIO";
gpio2.GPIO.$suggestSolution             = "GPIO";
gpio3.GPIO.$suggestSolution             = "GPIO";
gpio4.GPIO.$suggestSolution             = "GPIO";
gpio5.GPIO.$suggestSolution             = "GPIO";
gpio6.GPIO.$suggestSolution             = "GPIO";
gpio7.GPIO.$suggestSolution             = "GPIO";
gpio8.GPIO.$suggestSolution             = "GPIO";
debug_log.uartLog.UART.$suggestSolution = "UART0";
